       IDENTIFICATION DIVISION.
       PROGRAM-ID. stdin.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 n PIC X.
       PROCEDURE DIVISION.
           ACCEPT n
       STOP RUN.
      