       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTESTMT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 A PIC 99 VALUE 10.
           77 B PIC 99 VALUE 20.
           77 RESULT PIC 999.
       PROCEDURE DIVISION.
           COMPUTE RESULT = A + B.
           DISPLAY 'RESULT: ' RESULT.
           STOP RUN.
