IDENTIFICATION   DIVISION.
PROGRAM-ID.      screen_mixed.
DATA DIVISION.
SCREEN SECTION.
01 MAIN-SCREEN.
   05 LINE 1 COLUMN 5 VALUE "TITLE".
   05 LINE 2 COLUMN 10 PIC X(5) value 90.
   05 LINE 3 COLUMN 1 VALUE "END".
PROCEDURE DIVISION.
    DISPLAY MAIN-SCREEN
    STOP RUN.