IDENTIFICATION   DIVISION.
PROGRAM-ID.      prog.
DATA DIVISION.
SCREEN SECTION.
01 MAIN-SCREEN.
05 LINE 1 COLUMN 10 VALUE "HELLO".
05 LINE 2 COLUMN 5 VALUE "WORLD".
PROCEDURE DIVISION.
DISPLAY MAIN-SCREEN
STOP RUN.