IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 Y             PIC 9 value 18.
       PROCEDURE        DIVISION.
           INITIALIZE Y.
           STOP RUN.