IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 Y             PIC X value "DSD".
       PROCEDURE        DIVISION.
           INITIALIZE Y.
           STOP RUN.