    IDENTIFICATION   DIVISION.
    PROGRAM-ID.      prog.
    ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT MYFILE ASSIGN TO "test.txt".

    DATA DIVISION.
    FILE SECTION.
    FD MYFILE.
    01 MYFILE-REC.
    05 FIELD-1 PIC X(10).
    05 FIELD-2 PIC X(10).
    WORKING-STORAGE SECTION.
    01 MSG PIC X(20) VALUE "OVO JE TEST".

    PROCEDURE DIVISION.
    DISPLAY MSG

    OPEN OUTPUT MYFILE
    CLOSE MYFILE
    STOP RUN.