       IDENTIFICATION DIVISION.
       PROGRAM-ID. SimpleVariable.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AGE  PIC 9(2) VALUE 99.
       01 WS  PIC X(4) VALUE 'DUke'.
       PROCEDURE DIVISION.
       Main-Process.
           STOP RUN.
