       IDENTIFICATION DIVISION.
       PROGRAM-ID. Declaration.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AGE  PIC 9(2).
       PROCEDURE DIVISION.
       Main-Process.
           STOP RUN.
