       IDENTIFICATION DIVISION.
       PROGRAM-ID. Variables.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AGE PIC 9(3) VALUE 25.
       01 WS-NAME PIC X(4) VALUE "Duke".
       01 WS PIC 9(1).
       PROCEDURE DIVISION.
       Main-Process.
           STOP RUN.
